#+TITLE: qbank — módulo de generación de preguntas (parte quiz)
#+AUTHOR: Andrés Bujosa, Marcos Bujosa
#+LANGUAGE: es
#+OPTIONS: toc:t num:t H:4
#+STARTUP: overview

# ─── Configuración de org-babel ───────────────────────────────────
#+PROPERTY: header-args:python :noweb yes
#+PROPERTY: header-args:jupyter-python :kernel qbank

# ─── LaTeX export ────────────────────────────────────────────────
#+LATEX_CLASS: report
#+LATEX_CLASS_OPTIONS: [10pt,a4paper]


#+LATEX_HEADER: \usepackage{fontspec}          % para fuentes Unicode
#+LATEX_HEADER: \usepackage{lmodern}           % o mejor, define una fuente explícita
#+LATEX_HEADER: \setmainfont{Latin Modern Roman} % o cualquier otra que quieras
#+LATEX_HEADER: \usepackage[spanish]{babel}

#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \AtBeginEnvironment{verbatim}{\footnotesize}

# ─── Copyright ──────────────────────────────────────────────────────────────
# Copyright (C) 2020-2026  Andrés Bujosa, Marcos Bujosa
#
# This file is part of calcprop-qbank.
#
# calcprop-qbank is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# calcprop-qbank is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <https://www.gnu.org/licenses/>.

# ─── TeXinfo export ────────────────────────────────────────────────
# +TEXINFO_FILENAME: CalcPropQuiz.texi
# +TEXINFO_DIR_CATEGORY: The Info directory category (defaults to Misc).
# +TEXINFO_DIR_NAME: The short name used in the main Info directory

*** Funcionamiento General

Invocamos esta clase del siguiente modo: =Marcador(data)=, donde =data= es una lista de números enteros mayores que cero.
Por ejemplo, si invocamos  =Marcador([2, 3, 1])=, estamos pidiendo todas las listas =[i, j, k]= tales que $0 \le i < 2$,  $0 \le j < 3$  y $0 \le k < 1$ 
(es decir, la primera componente solo puede tomar dos valores (0 y 1), la segunda tres (0, 1 y 2) y la tercera solo puede valer $0$.

#+BEGIN_SRC jupyter-python
for i in Marcador([2,3,1]):
    print(i)
#+END_SRC

#+RESULTS:
: [0, 0, 0]
: [0, 1, 0]
: [0, 2, 0]
: [1, 0, 0]
: [1, 1, 0]
: [1, 2, 0]

*** Ejemplo de funcionamiento

Escribamos un hipotético ejercicio (es decir una lista que contiene cadenas de caracteres, supuestos, cuestiones, sublistas de supuestos o sublistas de cuestiones):

#+NAME: Ejemplo de programación de un ejercicio
#+BEGIN_SRC jupyter-python :results silent
ejercicio = [ "Considere ",
              [
                  Supuesto("A ", v("A")),
                  Supuesto("B ", v("B")),
              ],
              [
                  Supuesto("y que A implica C. ",    v("A") >> v("C")),
                  Supuesto("y que B equivale a D. ", v("B") ** v("D")),
              ],
              "Conteste: ",
              [
                  Cuestion("¿Se da C?", v("C"), exp="Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A"),
                  Cuestion("¿Se da D?", v("D")),
                  Cuestion("¿Se da E?", v("E"), v("D")),
              ],
              [
                  Cuestion("¿Se dan A y C?", v("A") & v("C")),
                  Cuestion("¿Se dan C y D?", v("C") & v("D")),
              ],
             ]
#+END_SRC

A continuación veamos lo que hace =ProblemaTipo= con la lista =ejercicio=. 
Observe que en cada iteración se toma un elemento de cada lista de supuestos y un elemento de cada lista de cuestiones para formar la combinación de un enunciado (compuesto por supuestos) y un subconjunto de preguntas (tantas como sublistas de cuestiones). Si alguna cuestión es descartada en una combinación, se salta a la siguiente combinación (indicando la cuestión descartada y el motivo). Así, =ProblemaTipo= muestra todas las combinaciones posibles de cuestiones que se pueden responder para cada combinación de supuestos. Fíjese que los elementos que no son listas (aquí las dos cadenas de caracteres) funcionan como sublistas con un único elemento (por eso en todas las iteraciones aparece tanto ='Considere'= como ='Conteste:'=).

#+NAME: Ejemplo de ProblemaTipo
#+BEGIN_SRC jupyter-python 
for i in ProblemaTipo( ejercicio ):
    print(i)
#+END_SRC

#+RESULTS: Ejemplo de ProblemaTipo
#+begin_example
('1', 'Considere A y que A implica C. Conteste: ', [('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan A y C?', True, 1, '')])
('2', 'Considere A y que A implica C. Conteste: ', [('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan C y D?', False, 1, '')])
('3', 'Considere A y que A implica C. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan A y C?', True, 1, '')])
('4', 'Considere A y que A implica C. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

('5', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan A y C?', False, 1, '')])
('6', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan C y D?', False, 1, '')])
('7', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan A y C?', False, 1, '')])
('8', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

('9', 'Considere B y que A implica C. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan A y C?', False, 1, '')])
('10', 'Considere B y que A implica C. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan C y D?', False, 1, '')])
('11', 'Considere B y que A implica C. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan A y C?', False, 1, '')])
('12', 'Considere B y que A implica C. Conteste: ', [('¿Se da D?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

('13', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan A y C?', False, 1, '')])
('14', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se dan C y D?', False, 1, '')])
('15', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da D?', True, 1, ''), ('¿Se dan A y C?', False, 1, '')])
('16', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da D?', True, 1, ''), ('¿Se dan C y D?', False, 1, '')])
('17', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da E?', False, 1, ''), ('¿Se dan A y C?', False, 1, '')])
('18', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da E?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])
#+end_example

Cuando la lista de cuestiones es extensa (o incluye aclaraciones), la representación en una tupla puede extenderse más allá de los márgenes de este documento al utilizar =print=. Para mejorar la claridad y facilitar la comprensión del funcionamiento de =ProblemaTipo=, desempaquetaremos los componentes devueltos por el iterador y los presentaremos de forma estructurada. Esto permitirá visualizar mejor los resultados.

En cada iteración, presentaremos el enunciado completo correspondiente, junto con las cuestiones incluidas, cada una en una línea separada (indicando su veracidad y la explicación incluida en el atributo el atributo =self.x= si no la hemos dejado vacía). Si la variante fue abortada, se indicará cuál fue la cuestión desencadenante y el motivo de la interrupción.

#+BEGIN_SRC jupyter-python
for i in ProblemaTipo( ejercicio ):
    # Desempaquetamos la tupla en variables
    id_pregunta, EnunciadoCompleto, lista_Cuestiones = i
    
    # Imprimimos los primeros datos
    print(f"ID: {id_pregunta}")
    print(f"Enunciado completo: {EnunciadoCompleto}")
    
    # Imprimimos la lista de c uestiones, cada cuestión en una línea
    print(*lista_Cuestiones, sep='\n')
    print('\n')
#+END_SRC

#+RESULTS:
#+begin_example
ID: 1
Enunciado completo: Considere A y que A implica C. Conteste: 
('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan A y C?', True, 1, '')


ID: 2
Enunciado completo: Considere A y que A implica C. Conteste: 
('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan C y D?', False, 1, '')


ID: 3
Enunciado completo: Considere A y que A implica C. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan A y C?', True, 1, '')


ID: 4
Enunciado completo: Considere A y que A implica C. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan C y D?', False, 1, '')



 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

ID: 5
Enunciado completo: Considere A y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan A y C?', False, 1, '')


ID: 6
Enunciado completo: Considere A y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan C y D?', False, 1, '')


ID: 7
Enunciado completo: Considere A y que B equivale a D. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan A y C?', False, 1, '')


ID: 8
Enunciado completo: Considere A y que B equivale a D. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan C y D?', False, 1, '')



 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

ID: 9
Enunciado completo: Considere B y que A implica C. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan A y C?', False, 1, '')


ID: 10
Enunciado completo: Considere B y que A implica C. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan C y D?', False, 1, '')


ID: 11
Enunciado completo: Considere B y que A implica C. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan A y C?', False, 1, '')


ID: 12
Enunciado completo: Considere B y que A implica C. Conteste: 
('¿Se da D?', False, 1, '')
('¿Se dan C y D?', False, 1, '')



 Cuestion: ¿Se da E? rechazada por v('D')


 Cuestion: ¿Se da E? rechazada por v('D')

ID: 13
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan A y C?', False, 1, '')


ID: 14
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se dan C y D?', False, 1, '')


ID: 15
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da D?', True, 1, '')
('¿Se dan A y C?', False, 1, '')


ID: 16
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da D?', True, 1, '')
('¿Se dan C y D?', False, 1, '')


ID: 17
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da E?', False, 1, '')
('¿Se dan A y C?', False, 1, '')


ID: 18
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da E?', False, 1, '')
('¿Se dan C y D?', False, 1, '')
#+end_example


En el ejemplo anterior, se observa que, para cada combinación de supuestos, en cada iteración solo se presenta una cuestión de cada sublista de cuestiones. Dado que hay solo dos sublistas, esto resulta en la visualización de dos preguntas por iteración, esto dificulta la revisión y mantenimiento del banco de preguntas.

En el anterior ejemplo, y aunque existen únicamente cuatro enunciados posibles y cinco preguntas en total, la combinatoria ha generado 18 variantes no descartables, cada una con un subconjunto de solo dos preguntas. Esta complejidad complica la tarea de revisar y mantener un banco de ejercicios eficaz.


*** Ejemplo de funcionamiento

Usaremos la misma lista =ejercicio= que usamos en el capítulo anterior

#+NAME: Ejemplo de ProblemaTipoProfe
#+BEGIN_SRC jupyter-python :results raw
for i in ProblemaTipoProfe( ejercicio ):
    print(i)
#+END_SRC

#+RESULTS: Ejemplo de ProblemaTipoProfe
: ('1', 'Considere A y que A implica C. Conteste: ', [('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se da D?', False, 1, ''), ('¿Se da E?', "rechazada por v('D')", 0), ('¿Se dan A y C?', True, 1, ''), ('¿Se dan C y D?', False, 1, '')])
: ('2', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se da D?', False, 1, ''), ('¿Se da E?', "rechazada por v('D')", 0), ('¿Se dan A y C?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])
: ('3', 'Considere B y que A implica C. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se da D?', False, 1, ''), ('¿Se da E?', "rechazada por v('D')", 0), ('¿Se dan A y C?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])
: ('4', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A'), ('¿Se da D?', True, 1, ''), ('¿Se da E?', False, 1, ''), ('¿Se dan A y C?', False, 1, ''), ('¿Se dan C y D?', False, 1, '')])

Como la vez anterior la representación en una tupla usando =print= se ha extendido más allá de los márgenes de este documento. Para evitar este problema y que el lector vea mejor el funcionamiento de =ProblemaTipoProfe=, vamos usar el mismo truco que en el capítulo anterior: Debajo de cada variante del enunciado completo, mostraremos todas las cuestiones de manera individual, cada una en una línea separada, junto con el cálculo de su veracidad o la indicación de si serán descartadas al emplear la clase =ProblemaTipo=. Si la cuestión incluye el atributo =self.x= con una explicación, también se muestra la explicación (si no, aparece una cadena vacía =''=).


#+BEGIN_SRC jupyter-python
for i in ProblemaTipoProfe( ejercicio ):
    # Desempaquetamos la tupla en variables
    id_pregunta, EnunciadoCompleto, lista_Cuestiones = i

    # Imprimimos los primeros datos
    print(f"ID: {id_pregunta}")
    print(f"Enunciado completo: {EnunciadoCompleto}")

    # Imprimimos la lista de c uestiones, cada cuestión en una línea
    print(*lista_Cuestiones, sep='\n')
    print('\n')
#+END_SRC

#+RESULTS:
#+begin_example
ID: 1
Enunciado completo: Considere A y que A implica C. Conteste: 
('¿Se da C?', True, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se da D?', False, 1, '')
('¿Se da E?', "rechazada por v('D')", 0)
('¿Se dan A y C?', True, 1, '')
('¿Se dan C y D?', False, 1, '')


ID: 2
Enunciado completo: Considere A y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se da D?', False, 1, '')
('¿Se da E?', "rechazada por v('D')", 0)
('¿Se dan A y C?', False, 1, '')
('¿Se dan C y D?', False, 1, '')


ID: 3
Enunciado completo: Considere B y que A implica C. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se da D?', False, 1, '')
('¿Se da E?', "rechazada por v('D')", 0)
('¿Se dan A y C?', False, 1, '')
('¿Se dan C y D?', False, 1, '')


ID: 4
Enunciado completo: Considere B y que B equivale a D. Conteste: 
('¿Se da C?', False, 1, 'Solo sabemos que C es cierto y si A implica C y además sabemos que ocurre A')
('¿Se da D?', True, 1, '')
('¿Se da E?', False, 1, '')
('¿Se dan A y C?', False, 1, '')
('¿Se dan C y D?', False, 1, '')
#+end_example

Vemos que son cuatro enunciados en total, y para cada uno de ellos vemos lo qué pasa con cada una de las cinco cuestiones posibles: si son verdaderas, si son falsas o si serán descartadas (y el motivo).
Ahora es mucho más fácil mejorar y depurar el =ejercicio= que estamos diseñando para nuestros exámenes de opción múltiple.



**** Generación de cuatro variantes cortas
En este primer ensayo se configuran cuatro ejercicios, solicitando únicamente dos preguntas tipo verdadero/falso para cada uno.

#+NAME: Ejemplo de ProblemaVF
#+BEGIN_SRC jupyter-python
enunciado = "Marque las verdaderas:"

p  = ProblemaVF (enunciado, banco, 2)      # Dos preguntas del banco por variante
p0 = iter(p)

for i in range(4):                         # Generamos cuatro variantes y paramos
    print(next(p0))
#+END_SRC

#+RESULTS: Ejemplo de ProblemaVF
: ('1', 'Marque las verdaderas:', [('Si suspenden todos es frustrante', True), ('Si aprueban todos es estupendo', True)])
: ('2', 'Marque las verdaderas:', [('Copiar es intolerable', True), ('Todo alumno que suspende va a clase', False)])
: ('3', 'Marque las verdaderas:', [('Todo alumno que suspende va a clase', False), ('Si suspenden todos eres mal profesor', False)])
: ('4', 'Marque las verdaderas:', [('Todo alumno que suspende va a clase', False), ('Todo alumno que sabe aprueba', True)])

**** Generación de cinco variantes con presentación formateada
Como la representación en una sola tupla puede dificultar la lectura a medida que el número de ítems crece, vamos a desempaquetar los componentes devueltos por el iterador para volcar los datos de manera estructurada para que se vea mejor el resultado, pues vamos a mostrar cada cuestión en una línea independiente. 

Dado que ahora lo vamos a ver mejor, aumentamos la complejidad solicitando tres preguntas por variante para un total de cinco ejercicios:

#+BEGIN_SRC jupyter-python :results raw
p  = ProblemaVF (enunciado, banco, 3)      # Tres preguntas por variante
p0 = iter(p)

for i in range(5):
    # Desempaquetamos la tupla en variables
    id_pregunta, EnunciadoCompleto, lista_Cuestiones = next(p0)

    # Imprimimos los primeros datos
    f"ID: {id_pregunta}"
    print(f"Enunciado completo: {EnunciadoCompleto}")

    # Imprimimos la lista de cuestiones, cada cuestión en una línea
    print(*lista_Cuestiones, sep='\n')
    print('\n')
#+END_SRC

#+RESULTS:
#+begin_example
Enunciado completo: Marque las verdaderas:
('Copiar es intolerable', True)
('Si suspenden todos eres mal profesor', False)
('Si suspenden todos es frustrante', True)


Enunciado completo: Marque las verdaderas:
('Todo alumno que suspende va a clase', False)
('Si aprueban todos es estupendo', True)
('Si aprueban todos eres buen profesor', False)


Enunciado completo: Marque las verdaderas:
('Si suspenden todos eres mal profesor', False)
('Copiar es intolerable', True)
('Si aprueban todos es estupendo', True)


Enunciado completo: Marque las verdaderas:
('Si suspenden todos es frustrante', True)
('Todo alumno que suspende va a clase', False)
('Todo alumno que va a clase aprueba', False)


Enunciado completo: Marque las verdaderas:
('Todo alumno que NO sabe suspende', False)
('Todo alumno que suspende va a clase', False)
('Todo alumno que sabe aprueba', True)
#+end_example

Como se puede apreciar en el resultado impreso, cada uno de los cinco bloques representa un ejercicio completamente autónomo con un identificador secuencial, conservando el enunciado general invariantemente e integrando un muestreo dinámico y heterogéneo extraído directamente de la lista de afirmaciones almacenada con el nombre de =banco=.



* COMMENT otros

#+BEGIN_SRC jupyter-python :results raw
pregunta = [
          "Considere ",
          [Supuesto("A ", v("A")), Supuesto("B ", v("B")), ],
          [Supuesto("y que A implica C. ",    v("A") >> v("C")), Supuesto("y que B equivale a D. ", v("B") ** v("D")), ],
          "Conteste: ",
          [Cuestion("¿Se da C?", v("C")), Cuestion("¿Se da D?", v("D")), Cuestion("¿Se da E?", v("E"), v("D")), Cuestion("¿Se dan A y C?", v("A") & v("C")), Cuestion("¿Se dan C y D?", v("C") & v("D")) ],
      ]

for c in pregunta:
    print(c)
#+END_SRC

#+RESULTS:
: Considere 
: [<calcprop_quiz.Supuesto object at 0x7f521c546850>, <calcprop_quiz.Supuesto object at 0x7f521c545910>]
: [<calcprop_quiz.Supuesto object at 0x7f521c5463d0>, <calcprop_quiz.Supuesto object at 0x7f521c546310>]
: Conteste: 
: [<calcprop_quiz.Cuestion object at 0x7f521c5457d0>, <calcprop_quiz.Cuestion object at 0x7f521c544d50>, <calcprop_quiz.Cuestion object at 0x7f521c545a90>, <calcprop_quiz.Cuestion object at 0x7f521c546ad0>, <calcprop_quiz.Cuestion object at 0x7f521c546490>]

#+BEGIN_SRC jupyter-python
for c in CuestionesJuntas(pregunta):
    print(c)
#+END_SRC

#+RESULTS:
: Considere 
: [<calcprop_quiz.Supuesto object at 0x7f521c546850>, <calcprop_quiz.Supuesto object at 0x7f521c545910>]
: [<calcprop_quiz.Supuesto object at 0x7f521c5463d0>, <calcprop_quiz.Supuesto object at 0x7f521c546310>]
: Conteste: 
: <calcprop_quiz.Cuestion object at 0x7f521c5457d0>
: <calcprop_quiz.Cuestion object at 0x7f521c544d50>
: <calcprop_quiz.Cuestion object at 0x7f521c545a90>
: <calcprop_quiz.Cuestion object at 0x7f521c546ad0>
: <calcprop_quiz.Cuestion object at 0x7f521c546490>


*** Ejemplo de funcionamiento

Cuatro ejercicios con dos preguntas tipo verdadero/falso cada uno.
#+NAME: Ejemplo de ProblemaVF
#+BEGIN_SRC jupyter-python
enunciado = "Marque las verdaderas:"

banco = [
  ("Todo alumno que va a clase aprueba",   False),
  ("Todo alumno que suspende va a clase",  False),
  ("Todo alumno que sabe aprueba",         True ),
  ("Todo alumno que NO sabe suspende",     False ),
  ("Algunos alumnos aprueban copiando",    True ),
  ("Copiar es intolerable",                True ),
  ("Si aprueban todos es estupendo",       True ),
  ("Si aprueban todos eres buen profesor", False),
  ("Si suspenden todos eres mal profesor", False),
  ("Si suspenden todos es frustrante",     True),]

p  = ProblemaVF (enunciado, banco, 2)      # tres preguntas por variante
p0 = iter(p)

for i in range(4):                         # cuatro variantes
    print(next(p0))
#+END_SRC

#+RESULTS: Ejemplo de ProblemaVF
: ('1', 'Marque las verdaderas:', [('Todo alumno que sabe aprueba', True), ('Si suspenden todos eres mal profesor', False)])
: ('2', 'Marque las verdaderas:', [('Si suspenden todos eres mal profesor', False), ('Todo alumno que suspende va a clase', False)])
: ('3', 'Marque las verdaderas:', [('Todo alumno que suspende va a clase', False), ('Si aprueban todos eres buen profesor', False)])
: ('4', 'Marque las verdaderas:', [('Si suspenden todos eres mal profesor', False), ('Si aprueban todos es estupendo', True)])


Cinco ejercicios con tres preguntas tipo verdadero/falso cada uno.

#+BEGIN_SRC jupyter-python
p  = ProblemaVF (enunciado, banco, 3)      # Tres preguntas por variante
p0 = iter(p)

for i in range(5):
    # Desempaquetamos la tupla en variables
    id_pregunta, EnunciadoCompleto, lista_Cuestiones = next(p0)

    # Imprimimos los primeros datos
    print(f"ID: {id_pregunta}")
    print(f"Enunciado completo: {EnunciadoCompleto}")

    # Imprimimos la lista de c uestiones, cada cuestión en una línea
    print(*lista_Cuestiones, sep='\n')
    print('\n')
#+END_SRC

#+RESULTS:
#+begin_example
ID: 1
Enunciado completo: Marque las verdaderas:
('Algunos alumnos aprueban copiando', True)
('Todo alumno que suspende va a clase', False)
('Si aprueban todos es estupendo', True)


ID: 2
Enunciado completo: Marque las verdaderas:
('Si aprueban todos eres buen profesor', False)
('Todo alumno que sabe aprueba', True)
('Todo alumno que NO sabe suspende', False)


ID: 3
Enunciado completo: Marque las verdaderas:
('Todo alumno que va a clase aprueba', False)
('Si aprueban todos es estupendo', True)
('Todo alumno que suspende va a clase', False)


ID: 4
Enunciado completo: Marque las verdaderas:
('Si suspenden todos es frustrante', True)
('Si aprueban todos eres buen profesor', False)
('Todo alumno que suspende va a clase', False)


ID: 5
Enunciado completo: Marque las verdaderas:
('Si suspenden todos eres mal profesor', False)
('Todo alumno que suspende va a clase', False)
('Algunos alumnos aprueban copiando', True)
#+end_example

